Revit 2026 API

# RebarConstraintGetTargetElement Method

---

Gets the Element object (either Host or Rebar) which provides the constraint. Will throw exception if it's a multi target constraint.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element GetTargetElement()
```
```vb
Public Function GetTargetElement As Element
```
```cpp
public:
Element^ GetTargetElement()
```
```fsharp
member GetTargetElement : unit -> Element
```

#### Return Value

Element Returns the Element object (either Host or Rebar) which provides the constraint.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- Multi target constraint. Consider using the indexed version of the method. -or- The RebarConstraint should not be of RebarConstraintType 'ToSurface'. |

#### Reference

RebarConstraint Class

GetTargetElement Overload

Autodesk.Revit.DB.Structure Namespace